РазработкаОУМобильная/src/Documents/УГМК_Упаковка/УГМК_Упаковка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УГМК_Упаковка</name>
  <attributes>
    <name>Организация</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <comment>(Упр)</comment>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>УГМК_СтруктурноеПодразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>Склад</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Склады</types>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <comment>(Общ)</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>(Общ) Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Тара</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </attributes>
  <attributes>
    <name>Брутто</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоТары</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>ЗаказПокупателя</name>
    <type>
      <types>DocumentRef.ЗаказПокупателя</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтгрузочнаяПартия</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВидОперации</name>
    <type>
      <types>EnumRef.УГМК_ВидыОперацийУпаковка</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <comment>(Общ)</comment>
    <attributes>
      <name>Номенклатура</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ХарактеристикаНоменклатуры</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ХарактеристикиНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>СерияНоменклатуры</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.СерииНоменклатуры</types>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмерения</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>ЕдиницаИзмеренияМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.ЕдиницыИзмерения</types>
      </type>
    </attributes>
    <attributes>
      <name>Коэффициент</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоМест</name>
      <comment>(Общ)</comment>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗаказПокупателя</name>
      <type>
        <types>DocumentRef.ЗаказПокупателя</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументОприходования</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Качество</name>
      <comment>(Общ)</comment>
      <type>
        <types>CatalogRef.Качество</types>
      </type>
    </attributes>
    <attributes>
      <name>СТК</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>9</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Брутто</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

РазработкаОУМобильная/src/Documents/УГМК_Упаковка/ManagerModule.bsl
Функция  ЗапросВыпуска(ВводСквозногоНомера,Дата,Подразделение) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("СквознойНомер", ВводСквозногоНомера);	
	Запрос.УстановитьПараметр("ДатаКон", Дата);	
	Запрос.УстановитьПараметр("Подразделение", Подразделение);	
	
	Запрос.Текст = "ВЫБРАТЬ РАЗРЕШЕННЫЕ
	               |	МатериалыВПроизводствеОстатки.Подразделение КАК Подразделение,
	               |	МатериалыВПроизводствеОстатки.Заказ КАК ЗаказПокупателя,
	               |	МатериалыВПроизводствеОстатки.Заказ.Контрагент КАК Контрагент,
	               |	МатериалыВПроизводствеОстатки.ХарактеристикаЗатраты КАК Характеристика,
	               |	МатериалыВПроизводствеОстатки.СерияЗатраты КАК Серия,
	               |	МатериалыВПроизводствеОстатки.КоличествоОстаток КАК Количество,
	               |	МатериалыВПроизводствеОстатки.Затрата КАК Номенклатура,
	               |	ВложенныйЗапрос.tb_НоменклатураID КАК СквознойНомер
	               |ИЗ
	               |	РегистрНакопления.МатериалыВПроизводстве.Остатки(&ДатаКон, Подразделение = &Подразделение) КАК МатериалыВПроизводствеОстатки
	               |		ЛЕВОЕ СОЕДИНЕНИЕ (ВЫБРАТЬ
	               |			ЗаказПокупателяТовары.Ссылка КАК ЗаказПокупателя,
	               |			ЗаказПокупателяТовары.Номенклатура КАК Номенклатура,
	               |			ЗаказПокупателяТовары.ХарактеристикаНоменклатуры КАК ХарактеристикаНоменклатуры,
	               |			ЗаказПокупателяТовары.tb_НоменклатураID КАК tb_НоменклатураID
	               |		ИЗ
	               |			Документ.ЗаказПокупателя.Товары КАК ЗаказПокупателяТовары
	               |		ГДЕ
	               |			ЗаказПокупателяТовары.Ссылка.ПометкаУдаления = ЛОЖЬ
	               |		
	               |		ОБЪЕДИНИТЬ ВСЕ
	               |		
	               |		ВЫБРАТЬ
	               |			КорректировкаЗаказаПокупателяТовары.Ссылка.ЗаказПокупателя,
	               |			КорректировкаЗаказаПокупателяТовары.Номенклатура,
	               |			КорректировкаЗаказаПокупателяТовары.ХарактеристикаНоменклатуры,
	               |			КорректировкаЗаказаПокупателяТовары.tb_НоменклатураID
	               |		ИЗ
	               |			Документ.КорректировкаЗаказаПокупателя.Товары КАК КорректировкаЗаказаПокупателяТовары
	               |		ГДЕ
	               |			КорректировкаЗаказаПокупателяТовары.Ссылка.ПометкаУдаления = ЛОЖЬ) КАК ВложенныйЗапрос
	               |		ПО МатериалыВПроизводствеОстатки.Заказ = ВложенныйЗапрос.ЗаказПокупателя
	               |			И МатериалыВПроизводствеОстатки.Затрата = ВложенныйЗапрос.Номенклатура
	               |			И МатериалыВПроизводствеОстатки.ХарактеристикаЗатраты = ВложенныйЗапрос.ХарактеристикаНоменклатуры
	               |ГДЕ
	               |	МатериалыВПроизводствеОстатки.Заказ ССЫЛКА Документ.ЗаказПокупателя
	               |	И ВложенныйЗапрос.tb_НоменклатураID = &СквознойНомер
	               |
	               |УПОРЯДОЧИТЬ ПО
	               |	Контрагент,
	               |	ЗаказПокупателя
	               |АВТОУПОРЯДОЧИВАНИЕ";	
	
	Возврат (Запрос.Выполнить().Выгрузить());
	
КонецФункции
